ERP.belugaerp/src/Catalogs/бг_НастройкиФиксацииПечатныхФорм/бг_НастройкиФиксацииПечатныхФорм.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бг_НастройкиФиксацииПечатныхФорм</name>
  <attributes>
    <name>ПечатнаяФорма</name>
    <type>
      <types>CatalogRef.бг_ФиксируемыеПечатныеФормы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервичноеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПовторноеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиСканирования</name>
    <attributes>
      <name>ТегОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>EnumRef.бг_ОшибкиСканированияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаОшибки</name>
      <type>
        <types>CatalogRef.бг_РасшифровкиОшибокСканирования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/бг_НастройкиФиксацииПечатныхФорм/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаУникальностиИспользуемойНастройкиПоПечатнойФорме(Отказ);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаУникальностиИспользуемойНастройкиПоПечатнойФорме(Отказ)
	
	Если ПометкаУдаления 
		Или Не Используется Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиФиксацииПечатныхФорм.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.бг_НастройкиФиксацииПечатныхФорм КАК НастройкиФиксацииПечатныхФорм
		|ГДЕ
		|	НастройкиФиксацииПечатныхФорм.ПечатнаяФорма = &ПечатнаяФорма
		|	И НастройкиФиксацииПечатныхФорм.Используется
		|	И НЕ НастройкиФиксацииПечатныхФорм.ПометкаУдаления
		|	И НастройкиФиксацииПечатныхФорм.Ссылка <> &Ссылка";

	Запрос.УстановитьПараметр("ПечатнаяФорма", ПечатнаяФорма);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ШаблонОшибки = НСтр("ru='Уже есть активная настройка для печатной формы %1. 
						|Пометьте на удаление дублирующиеся элементы справочника 
						|или отключите использование настройки'");
	
	ОбщегоНазначения.СообщитьПользователю(
		СтрШаблон(ШаблонОшибки, ПечатнаяФорма),, 
		"Объект.ПечатнаяФорма",, 
		Отказ); 
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
